[
    {
      "title": "Video Presentation",
      "text": "Submit video recording of a documented Brain Integration session.\nVideo must not exceed 30 minutes in length and must include the following knowledge and skills:\n• Physical demonstration of knowledge\n• Explaining the process of Brain Integration\n• Express knowledge of appropriate reasoning of the procedure\n• Demonstrate balance process\n• Powers of stress alleviation\n• Knowledge of meridian points/ alarm points\n• Pause-lock procedure"
    },
    {
      "title": "Brain Integration Training",
      "text": "Complete 500 hours of relevant brain integration training.\nThe Brain Integration Training program requires a comprehensive 500-hour training to ensure proficiency and expertise in the field. The training is divided into three key areas: Standard Knowledge Base, Professional Training, and Competency Base. Below is a detailed breakdown of each component:\nStandard Knowledge Base\nAnatomy and Physiology: Understanding the human body's structure and function, with a focus on the brain and nervous system.\nBrain Integration Awareness and Systems: Learning the principles of brain integration, including how different parts of the brain communicate and work together.\nExecutive Functions: Studying the brain's higher-order processes, such as planning, decision-making, problem-solving, and impulse control.\nSenses and Reflexes: Exploring how sensory input and reflex actions contribute to brain function and integration.\nTechniques and Applications: Mastering various techniques for brain integration and their practical applications in clinical settings.\nProfessional Training\nObjectives and Assessments: Setting clear objectives for brain integration sessions and learning how to assess client progress effectively.\nProfessional Conduct: Maintaining a high standard of professionalism in all interactions with clients and colleagues.\nEthics and Boundaries: Adhering to ethical guidelines and establishing appropriate boundaries in client relationships.\nGood Business Practices: Implementing sound business practices, including client management, record-keeping, and financial responsibilities.\nCompetency Base\nEffective Communication: Developing strong communication skills to interact effectively with clients and colleagues.\nClient Clinic Services: Providing comprehensive clinic services, from initial consultations or follow-up sessions.\nCompetency-Based Testing: Demonstrating proficiency through practical exams and assessments.\nCertification: Successfully completing the certification process to become a recognized Brain Integration practitioner. Upon completion of the 500-hour training, participants must upload proof of their training hours to receive certification. This ensures that all practitioners meet the rigorous standards required to provide high-quality brain integration services."
    },
    {
      "title": "Clinical Hours",
      "text": "Completion of 200 hours of clinical practice in brain integration or kinesiology including various populations and settings.\nWe encourage the following:\n• Practicum with the public\n• Practicums in a lab setting with oversight\n• SOAP notes, or subjective, objective, assessment, and plan notes, are a standardized method used by professionals to document client interactions\n• Experience brain integration with children, teenagers, adults, and special needs"
    },
    {
      "title": "First Aid Certification",
      "text": "Show proof of First Aid Certification\nUpload your current First Aid certifications. Scan or photograph both sides of your certification card. Save the file as PDF or JPEG. Click the “Upload” button and select your files."
    },
    {
      "title": "CPR Certification",
      "text": "Show proof of CPR certification\nUpload your current CPR certification. Scan or photograph both sides of your certification card. Save the files as PDF or JPEG. Click the 'Upload' button and select your files.\nHere is a suggested location to complete this requirement by using your smartphone: https://resuscitech.io/smart-certification\nOnce completed, copy the certificate and upload the documents."
    },
    {
      "title": "Insurance",
      "text": "Show proof of professional and liability insurance Upload proof of professional and liability insurance (e.g., ABMP).\nInstructions:\nScan or photograph your insurance certificate.\nSave the file as PDF or JPEG.\nClick the 'Upload Insurance' button below and select your file."
    },
    {
      "title": "Study Guide",
      "text": "Areas of knowledge for the Study Guide Having knowledge of Structure, Function and Processes.\n\nnBiar\nTriune Brain\nHigher brain\nIntermediate Brain\nLower Brain\nCerebral Cortex\nLobes\nCerebrum\nHemispheres\nLimbic system\nBasal Ganglia\nHypothalamus\nAmygdala\nThalamus\nHippocampus\nCingulate Gyrus\nDiencephalon\nThalamus\nHypothalamus\n\nEpithalamus Subthalamus\nBrainstem Midbrain\nPons\nMedula\nThe Cerebellum Cerebrocerebellum Spinocerebellum Vestibulocerebellum\nGrey\nMater\nWhite\nMater\nCommissural fibers\nAssociation fibers\nNervous system\nNeuron Anatomy\nCel body\nDendrites\nAxon Transport Vesicles Neuron Function Neuron communication Type of signals Sensor neurons and Interneurons Motor neurons Spinal Cord Cervical Thoracic\nLumbar Sacral\nCranial nerves\nI The Olfactory Il Optic Nerve Oculomotor VI Trochlear\nV Trigeminal VI Abducens\nVIl Facial XI Glossopharyngeal\nXVagus XI Accessory IXI Hypoglossal Bones Skull\nBones of the Head\nSpinal Cord Cervical\nThoracic Lumbar\nSacral 5 Element Theory Executive functions\nChakras Meridian lines Muscles\nPurchase the Comprehensive Study guide: $65.00 +tax. Get Study Guide"
    },
    {
      "title": "Assessment",
      "text": "$PayforAssessment\n\nStartAssessment"
    }
  ]
  